app/views/profiles/_form.html.erb

     <%= form.label :location %>
     <%= form.select :location_id, options_from_collection_for_select(Location.all, :id, :full_address), id: :profile_location_id %>
---
SELECT "locations".* FROM "locations"