app/views/stores/index.html.erb

        <td><%= store.name %></td>
        <td><%= store.user.profile.full_name if store.user.profile.present? %></td>
        <td><%= store.location.full_address  if store.location.present? %></td>
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = $1 LIMIT $2  [["user_id", 2], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "locations".* FROM "locations" WHERE "locations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]


<% if current_user.store.present? %>
---
SELECT  "stores".* FROM "stores" WHERE "stores"."user_id" = $1 LIMIT $2  [["user_id", 66], ["LIMIT", 1]]