app/views/users/index.html.erb

      <tr>
        <td><div class="image-cropper"><%= image_tag user.profile.image_url(:thumb) if user.profile.present? %></div></td>
        <td><%= user.profile.full_name if user.profile.present? %></td>
        <td><%= user.profile.location.full_address if user.profile.present? %></td>
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = $1 LIMIT $2  [["user_id", 9], ["LIMIT", 1]]
SELECT  "locations".* FROM "locations" WHERE "locations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]