app/controllers/charges_controller.rb

  def set_item
  @product = Product.find(params[:id])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]