app/controllers/products_controller.rb

SELECT  "stores".* FROM "stores" WHERE "stores"."user_id" = $1 ORDER BY "stores"."id" ASC LIMIT $2  [["user_id", 2], ["LIMIT", 1]]
INSERT INTO "products" ("price", "stock_level", "description", "category_id", "store_id", "created_at", "updated_at", "name", "image") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
UPDATE "products" SET "image" = 'image/upload/v1525669347/oamyvxuxiyprn3wop4tj.jpg' WHERE "products"."id" = $1  [["id", 14]]
---
  def create
    @product = Product.new(product_params)
    @product.store_id = Store.where({user_id: current_user.id}).first.id

    respond_to do |format|
      if @product.save

UPDATE "products" SET "name" = $1, "description" = $2, "updated_at" = $3 WHERE "products"."id" = $4  [["name", "Basket"], ["description", "Hand woven basket. Perfect for Easter egg hunts, storing your knitting or picking daisies."], ["updated_at", "2018-05-07 04:32:14.719300"], ["id", 10]]
---
  def update
    respond_to do |format|
      if @product.update(product_params)