app/controllers/profiles_controller.rb

INSERT INTO "profiles" ("first_name", "last_name", "street_address", "location_id", "phone_number", "bio", "user_id", "created_at", "updated_at", "image") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    @profile = Profile.new(profile_params)
    @profile.user_id = current_user.id

    respond_to do |format|
      if @profile.save

UPDATE "profiles" SET "image" = $1, "updated_at" = $2 WHERE "profiles"."id" = $3  [["image", "z18apqaebnwgdd6r1xq9.jpg"], ["updated_at", "2018-05-07 05:25:35.743062"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @profile.update(profile_params)