app/controllers/stores_controller.rb

INSERT INTO "stores" ("name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Bill's Pickles"], ["user_id", 2], ["created_at", "2018-05-01 07:30:34.420725"], ["updated_at", "2018-05-01 07:30:34.420725"]]
---
  def create
    @store = Store.new(store_params)
    @store.user_id = current_user.id

    respond_to do |format|
      if @store.save

UPDATE "stores" SET "name" = $1, "updated_at" = $2 WHERE "stores"."id" = $3  [["name", "Coffee Supplies"], ["updated_at", "2018-05-06 00:24:57.101417"], ["id", 9]]
---
  def update
    respond_to do |format|
      if @store.update(store_params)

DELETE FROM "stores" WHERE "stores"."id" = $1  [["id", 5]]
---
  def destroy
    @store.destroy