app/views/categories/index.html.erb

SELECT "products".* FROM "products" WHERE "products"."category_id" = $1  [["category_id", 2]]
---
        <td><%= category.name %></td>
        <td><%= 'Products available' if category.products.present? %></td>