app/views/categories/show.html.erb

SELECT "products".* FROM "products" WHERE "products"."category_id" = $1  [["category_id", 2]]
---

<% if @category.products.present? %>