app/views/products/_form.html.erb

SELECT "categories".* FROM "categories"
---
     <%= form.label :category %>
     <%= form.select :category_id, options_from_collection_for_select(Category.all, :id, :name), id: :product_category_id %>