app/views/products/index.html.erb


<%if user_signed_in? && current_user.store.present?%>
---
SELECT  "stores".* FROM "stores" WHERE "stores"."user_id" = $1 LIMIT $2  [["user_id", 8], ["LIMIT", 1]]